from pptx import Presentation
import pandas as pd
from pptx.util import Cm, Pt
from pptx.dml.color import RGBColor
from pptx.enum.text import PP_ALIGN
#debug：B作为变量重复使用
def 文本框(h,w,l,t,txt,R,G,B):
    height = Cm(h)
    width = Cm(w)
    left = Cm(l)
    top = Cm(t)
    文本框对象 = 幻灯片.shapes.add_textbox(left, top, width, height)
    段落 = 文本框对象.text_frame.paragraphs[0]
    段落.text = txt
    段落.alignment = PP_ALIGN.CENTER
    段落.font.bold = False
    段落.font.name = "华文行楷"
    段落.font.color.rgb = RGBColor(R,G,B)
    段落.font.size = Pt(18)
def 图像(l,t,h,road):
    left = Cm(l)#水平距离
    top = Cm(t)#竖直距离
    height = Cm(h)#图片高度
    幻灯片.shapes.add_picture(road,left,top,height=height)
    return
文件 = Presentation("原神封面母版.pptx")
幻灯片 = 文件.slides.add_slide(文件.slide_layouts[0])
数据 = pd.read_excel("原神.xlsx")
print("输入角色全称：")
a=input("first:")
b=input("second:")
c=input("third:")
d=input("forth:")
for 行号 in 数据["序号"]:
    角色 = 数据.loc[行号-1,"角色"]
    武器 = 数据.loc[行号-1,"武器"]
    圣遗物1 = 数据.loc[行号-1,"圣遗物1"]
    圣遗物2 = 数据.loc[行号-1,"圣遗物2"]
    沙 = 数据.loc[行号-1,"沙"]
    杯 = 数据.loc[行号-1,"杯"]
    冠 = 数据.loc[行号-1,"冠"]
    R = int(数据.loc[行号-1,"R"])
    G = int(数据.loc[行号-1,"G"])
    B = int(数据.loc[行号-1,"B"])
    if 角色 == a :
        图像(6.21,0.53,4.73,f'原神图标/头像2/{角色}.png')
        图像(0.95,6.17,3.9,f'原神图标/头像2/{角色}.png')
        图像(5.03,6.68,3.29,f'原神图标/武器/{武器}.png')
        图像(9.17,7.82,1.81,f'原神图标/圣遗物/{圣遗物1}.png')
        图像(12.06,7.82,1.81,f'原神图标/圣遗物/{圣遗物2}.png')
        文本框(1.03,3.72,0.71,10.29,角色,R,G,B)
        文本框(1.03,4.36,4.43,10.29,武器,R,G,B)
        文本框(1.03,5,9,6.41,圣遗物1,R,G,B)
        文本框(1.03,5,8.98,10.29,圣遗物2,R,G,B)
        文本框(2.57,1.15,10.91,7.56,f'{沙}\n{杯}\n{冠}',R,G,B)
    elif 角色 == b :
        图像(10.65,0.53,4.73,f'原神图标/头像2/{角色}.png')
        图像(15.77,6.17,3.9,f'原神图标/头像2/{角色}.png')
        图像(19.85,6.68,3.29,f'原神图标/武器/{武器}.png')
        图像(23.99,7.82,1.81,f'原神图标/圣遗物/{圣遗物1}.png')
        图像(26.88,7.82,1.81,f'原神图标/圣遗物/{圣遗物2}.png')
        文本框(1.03,3.72,15.53,10.29,角色,R,G,B)
        文本框(1.03,4.36,19.25,10.29,武器,R,G,B)
        文本框(1.03,5,23.82,6.41,圣遗物1,R,G,B)
        文本框(1.03,5,23.8,10.29,圣遗物2,R,G,B)
        文本框(2.57,1.15,25.73,7.56,f'{沙}\n{杯}\n{冠}',R,G,B)
    elif 角色 == c :
        图像(15.1,0.53,4.73,f'原神图标/头像2/{角色}.png')
        图像(0.95,12.08,3.9,f'原神图标/头像2/{角色}.png')
        图像(5.03,12.59,3.29,f'原神图标/武器/{武器}.png')
        图像(9.17,13.73,1.81,f'原神图标/圣遗物/{圣遗物1}.png')
        图像(12.06,13.73,1.81,f'原神图标/圣遗物/{圣遗物2}.png')
        文本框(1.03,3.72,0.71,16.2,角色,R,G,B)
        文本框(1.03,4.36,4.43,16.2,武器,R,G,B)
        文本框(1.03,5,9,12.32,圣遗物1,R,G,B)
        文本框(1.03,5,8.98,16.2,圣遗物2,R,G,B)
        文本框(2.57,1.15,10.91,13.47,f'{沙}\n{杯}\n{冠}',R,G,B)
    elif 角色 == d :
        图像(19.45,0.53,4.73,f'原神图标/头像2/{角色}.png')
        图像(15.77,12.08,3.9,f'原神图标/头像2/{角色}.png')
        图像(19.85,12.59,3.29,f'原神图标/武器/{武器}.png')
        图像(23.99,13.73,1.81,f'原神图标/圣遗物/{圣遗物1}.png')
        图像(26.88,13.73,1.81,f'原神图标/圣遗物/{圣遗物2}.png')
        文本框(1.03,3.72,15.53,16.2,角色,R,G,B)
        文本框(1.03,4.36,19.25,16.2,武器,R,G,B)
        文本框(1.03,5,23.82,12.32,圣遗物1,R,G,B)
        文本框(1.03,5,23.8,16.2,圣遗物2,R,G,B)
        文本框(2.57,1.15,25.73,13.47,f'{沙}\n{杯}\n{冠}',R,G,B)
图像(0.71,0.99,3.88,f'原神图标/设计/阵容模拟器.png')
图像(24.44,0.68,4.5,f'原神图标/设计/叁月負柒.png')
文件.save(f'{a}{b}{c}{d}阵容模拟器.pptx')
